In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Capitalizing and creating separate columns for from and to

In [4]:
df.From_To = df.From_To.str.title()

In [5]:
df.From_To = df['From_To'].str.replace("_"," ").str.split()

In [6]:
df

               From_To  FlightNumber  RecentDelays              Airline
0      [London, Paris]       10045.0      [23, 47]               KLM(!)
1      [Madrid, Milan]           NaN            []    <Air France> (12)
2  [London, Stockholm]       10065.0  [24, 43, 87]  (British Airways. )
3    [Budapest, Paris]           NaN          [13]       12. Air France
4   [Brussels, London]       10085.0      [67, 32]          "Swiss Air"

In [7]:
df['From'] = df.From_To.apply(pd.Series)[0]
df['To'] = df.From_To.apply(pd.Series)[1]

In [8]:
df.drop(['From_To'],axis = 1,inplace = True)

# The flight numbers are in increements of 10

In [19]:
for i in range(1,len(df.FlightNumber)+1):
    df.FlightNumber[i] = df.FlightNumber[i-1]+10

In [10]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

# List of recent_delays column into separate column

In [11]:
df.RecentDelays

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [12]:
df2 = df['RecentDelays'].apply(pd.Series).add_prefix('RecentDelays_')

In [13]:
df = df.join(df2)

In [14]:
df.drop(['RecentDelays'],axis=1,inplace = True)

# Airline names :  keeping only the names removing inverted commas and unnecessary numbers

In [15]:
df['Airline'] = df.Airline.str.replace('[^a-zA-Z]', '')

In [16]:
df

,FlightNumber,Airline,From,To,RecentDelays_0,RecentDelays_1,RecentDelays_2
0,10045.0,KLM,London,Paris,23.0,47.0,NaN
1,10055.0,AirFrance,Madrid,Milan,NaN,NaN,NaN
2,10065.0,BritishAirways,London,Stockholm,24.0,43.0,87.0
3,10075.0,AirFrance,Budapest,Paris,13.0,NaN,NaN
4,10085.0,SwissAir,Brussels,London,67.0,32.0,NaN

In [17]:
df = df.reindex(columns=['From','To','FlightNumber','RecentDelays_0','RecentDelays_1','RecentDelays_2','Airline'])
df

,From,To,FlightNumber,RecentDelays_0,RecentDelays_1,RecentDelays_2,Airline
0,London,Paris,10045.0,23.0,47.0,NaN,KLM
1,Madrid,Milan,10055.0,NaN,NaN,NaN,AirFrance
2,London,Stockholm,10065.0,24.0,43.0,87.0,BritishAirways
3,Budapest,Paris,10075.0,13.0,NaN,NaN,AirFrance
4,Brussels,London,10085.0,67.0,32.0,NaN,SwissAir